app/controllers/tasks_controller.rb

    task = Task.new({
      title: params[:task][:title],
      description: params[:task][:description]
      })
    task.save
---
INSERT INTO "tasks" ("title", "description") VALUES ($1, $2) RETURNING "id"  [["title", "task"], ["description", "task1\r\n"]]

  task = Task.find(params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
  Task.destroy(params[:id])
---
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]